Revit 2024 API
FilterableValueProvider.GetDoubleValue Method
 Gets a double-precision numeric value from the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double GetDoubleValue(
	Element element
)
Visual Basic
Public Function GetDoubleValue ( _
	element As Element _
) As Double
Visual C++
public:
double GetDoubleValue(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The element to query.
Return Value
 The double-precision numeric value from the element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilterableValueProvider Class
Autodesk.Revit.DB Namespace